# Andrew Podhorecki
## 11/17/2020 WK13
### Dataframe Processing

In [1]:
import numpy as np

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# drop entries

df = DataFrame((np.arange(16).reshape(4,4)),
index=['OH','CO','UT','NY'],
columns=['one','two','three','four'])

df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [4]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [5]:
# to drop co and oh (drop rows)

df.drop(['CO','OH'])

    one  two  three  four
UT    8    9     10    11
NY   12   13     14    15

In [6]:
df.drop('two',axis=1)

    one  three  four
OH    0      2     3
CO    4      6     7
UT    8     10    11
NY   12     14    15

In [7]:
df.drop(['two','four'],axis=1)

    one  three
OH    0      2
CO    4      6
UT    8     10
NY   12     14

In [8]:
df.drop(['two','four'],axis='columns')

df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [9]:
#inplace will actually affect and change the data itself
df.drop(['two','four'],inplace = True,axis='columns')
df

    one  three
OH    0      2
CO    4      6
UT    8     10
NY   12     14

In [10]:
#
# select entries
#

df = DataFrame((np.arange(16).reshape(4,4)),
index=['OH','CO','UT','NY'],
columns=['one','two','three','four'])

df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [12]:
df['one']

OH     0
CO     4
UT     8
NY    12
Name: one, dtype: int32

In [13]:
# select 2 columns (pass as as list)

df[['two','four']]

    two  four
OH    1     3
CO    5     7
UT    9    11
NY   13    15

In [14]:
# only keeps things greater than x

df[df['three']>5]

    one  two  three  four
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [15]:
# returns as boolean (ex: want to see who passed exam vs who didnt)

df > 5

      one    two  three   four
OH  False  False  False  False
CO  False  False   True   True
UT   True   True   True   True
NY   True   True   True   True

In [16]:
# gives all values < 5 a value of 0

df[df < 5] = 0

df

    one  two  three  four
OH    0    0      0     0
CO    0    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [17]:
# select entries with location (loc) adn index location (iloc)

df.loc['CO']

one      0
two      5
three    6
four     7
Name: CO, dtype: int32

In [18]:
df.loc['CO', ['two','four']]

two     5
four    7
Name: CO, dtype: int32

In [20]:
df.iloc[2]

one       8
two       9
three    10
four     11
Name: UT, dtype: int32

In [22]:
df.iloc[2, [3,0,1]] #using index location

four    11
one      8
two      9
Name: UT, dtype: int32

In [23]:
df

    one  two  three  four
OH    0    0      0     0
CO    0    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [32]:
# arithmetic and alignment of data

df1 = DataFrame(np.arange(9).reshape(3,3), columns = list('bcd'),
               index=['OH',"TX","CO"])

df2 = DataFrame(np.arange(12).reshape(4,3), columns = list('bde'),
               index=['OH',"TX","UT","OG"])

df1

    b  c  d
OH  0  1  2
TX  3  4  5
CO  6  7  8

In [33]:
df2

    b   d   e
OH  0   1   2
TX  3   4   5
UT  6   7   8
OG  9  10  11

In [34]:
df1 + df2

      b   c    d   e
CO  NaN NaN  NaN NaN
OG  NaN NaN  NaN NaN
OH  0.0 NaN  3.0 NaN
TX  6.0 NaN  9.0 NaN
UT  NaN NaN  NaN NaN

In [35]:
df1.add(df2,fill_value=0)

      b    c     d     e
CO  6.0  7.0   8.0   NaN
OG  9.0  NaN  10.0  11.0
OH  0.0  1.0   3.0   2.0
TX  6.0  4.0   9.0   5.0
UT  6.0  NaN   7.0   8.0

In [37]:
df1['e'] = df1['b'] + df1['d']

In [38]:
df1

    b  c  d   e
OH  0  1  2   2
TX  3  4  5   8
CO  6  7  8  14

In [39]:
# operatin between data frame and series

s = df2.iloc[0]
s

b    0
d    1
e    2
Name: OH, dtype: int32

In [42]:
df2

    b   d   e
OH  0   1   2
TX  3   4   5
UT  6   7   8
OG  9  10  11

In [40]:
df2 + s

    b   d   e
OH  0   2   4
TX  3   5   7
UT  6   8  10
OG  9  11  13

In [41]:
df2 - s

    b  d  e
OH  0  0  0
TX  3  3  3
UT  6  6  6
OG  9  9  9

In [43]:
# sort and rank

df3 = DataFrame(np.arange(8).reshape(2,4), columns = list('dabc'),
               index=['three','one'])

In [44]:
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [45]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [46]:
df3.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [47]:
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [48]:
df3.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [52]:
# sort by values

df4 = DataFrame({'b':  [4,7,-3,2],'a':  [0,1,0,1]})

In [53]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [54]:
df4.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [55]:
df4.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [56]:
df5 = DataFrame({'b':  [14,17,1-3,12],'a':  [10,11,10,11]})

df5

    b   a
0  14  10
1  17  11
2  -2  10
3  12  11

In [57]:
df4.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [58]:
df5.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5